app/controllers/groups_controller.rb

  def index
  	@groups=Group.all
---
SELECT `groups`.* FROM `groups`

  def new
  	Group.create_new_group
  	@groups=Group.all
---
INSERT INTO `groups` (`name`, `round_number`, `round_started_on`, `created_at`, `updated_at`, `participants`) VALUES ('Group 1', 1, '2020-07-12 00:00:00', '2020-07-12 16:39:17', '2020-07-12 16:39:17', '[1, 2, 3]')
SELECT  `groups`.* FROM `groups` ORDER BY `groups`.`id` DESC LIMIT 1