app/models/department.rb

	def self.select_one_employee_from_each_department
		all_department_ids=self.all.pluck(:id)
		selected_employee_ids=[]
		all_department_ids.each do |d|
			department=self.find(d)
			first_employee=department.employees.first
---
SELECT `departments`.`id` FROM `departments`
SELECT  `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
SELECT  `employees`.* FROM `employees` WHERE `employees`.`department_id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1