app/models/group.rb

SELECT  `groups`.* FROM `groups` ORDER BY `groups`.`id` DESC LIMIT 1
---
  	def self.latest_group_created
  		@latest_group_created=self.last

INSERT INTO `groups` (`name`, `round_number`, `round_started_on`, `created_at`, `updated_at`, `participants`) VALUES ('Group 1', 1, '2020-07-12 00:00:00', '2020-07-12 16:39:17', '2020-07-12 16:39:17', '[1, 2, 3]')
---
  	def self.create_first_group_new_round
  		employees_for_group= Department.select_one_employee_from_each_department
  		self.create(name: "Group 1", round_number: 1, round_started_on: Date.today(),participants: employees_for_group)